app/controllers/admin/orders_controller.rb

    def find_order
      @order = Order.find_by id: params[:id]
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]