app/views/admin/orders/_order_item_current.html.erb

SELECT "order_dishes".* FROM "order_dishes" WHERE "order_dishes"."order_id" = $1  [["order_id", 21]]
---
<tbody class="default-dg-table">
  <% order.order_dishes.each do |order_dish| %>