app/views/admin/orders/_order_info.html.erb

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
---
            <i class="fa fa-id-card"></i>
            <%= t "admin.orders.order.code" %>:

SELECT  "tables".* FROM "tables" WHERE "tables"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
---
            <i class="fa fa-table"></i>
            <%= t "admin.orders.order.table" %>