app/controllers/customers_controller.rb

INSERT INTO "customers" ("name", "email", "phone_num", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "dao hung"], ["email", "memsenpai3@gmail.com"], ["phone_num", "0216574984"], ["created_at", "2017-11-25 17:06:32.901463"], ["updated_at", "2017-11-25 17:06:32.901463"]]
---
  def create
    customer = Customer.new customer_params
    code = nil
    message = nil
    if customer.save

SELECT  "customers".* FROM "customers" WHERE "customers"."code" = $1 LIMIT $2  [["code", "1"], ["LIMIT", 1]]
---
  def find_customer code
    session[:customer] = Customer.find_by code: code