app/views/admin/dishes/_dish.html.erb

    <tbody>
      <% if dishes_support.dishes_search.any? %>
---
SELECT COUNT(*) FROM "dishes"